Feature: ค่าบริการห้องพักโรงแรม

การคำนวณค่าห้องพักโรงแรมจะประกอบไปด้วย ค่าห้องพักต่อคืน และ ค่าใช้จ่ายเพิ่มเติมต่างๆ
เช่น ผู้ใช้บริการขอเข้าห้องก่อนเวลาที่กำหนด ผู้ใช้บริการขอคืนห้องล่าช้า ฯลฯ ซึ่งค่าใช้จ่าย
ทั้งหมดมีรายละเอียดในการคำนวณตามด้านล่างนี้

1. ราคาห้องพักจะขึ้นอยู่กับระดับห้องพักที่เลือกดังนี้
	| Grade		| Cost/Day	|
	| Standard	| 1000		|
	| Superior	| 2500		|
	| Deluxe	| 7000		|
2. ถ้าผู้ใช้บริการเข้าพักหลังเวลา 12:00 และ 
	คืนห้องก่อนเวลา 12:00 จะไม่มีค่าใช้จ่ายเพิ่มเติม
3. กรณีผู้ใช้บริการเข้าพักหรือคืนห้องนอกเวลา จะมีค่าใช้จ่ายเพิ่มเติมดังนี้
	| Case							| Penalty	|
	| Early check-in before  6:00	| 100%		|
	| Early check-in after   6:00	| 50%		|
	| Late check-out before 12:00	| 50%		|
	| Late check-out after  18:00	| 100%		|
 
Scenario: ผู้ใช้บริการที่เข้าพักและคืนห้องในช่วงเวลาปรกติ จะต้องไม่มีค่าใช้จ่ายเพิ่มเติม
	Given ผู้ใช้เลือกห้องพักระดับ Standard
	And เริ่มเข้าพักเมื่อ 1/2/2022 เวลา 15:13
	And คืนห้องพักเมื่อ 4/2/2022 เวลา 11:45
	When ผู้ใช้บริการขอชำระเงินค่าห้องพัก
	Then ระบบแจ้งค่าใช้จ่ายรวมทั้งหมด 3000 บาท
	And ระบบทำการบันทึกรายละเอียดค่าใช้จ่ายเป็นดังนี้
		| No | Range 							| Cost |
		| 1  | 1/2/2022 15:13 - 2/2/2022 12:00	| 1000 |
		| 2  | 2/2/2022 12:00 - 3/2/2022 12:00	| 1000 |
		| 3  | 3/2/2022 12:00 - 4/2/2022 11:45	| 1000 |

Scenario: ผู้ใช้บริการเข้าพักและคืนห้องนอกเวลา จะมีค่าใช้จ่ายเพิ่มเติม
	Given ผู้ใช้เลือกห้องพักระดับ Standard
	And เริ่มเข้าพักเมื่อ 5/2/2022 เวลา 6:31
	And คืนห้องพักเมื่อ 5/2/2022 เวลา 18:20
	When ผู้ใช้บริการขอชำระเงินค่าห้องพัก
	Then ระบบแจ้งค่าใช้จ่ายรวมทั้งหมด 1500 บาท
	And ระบบทำการบันทึกรายละเอียดค่าใช้จ่ายเป็นดังนี้
		| No | Range 							| Cost |
		| 1  | 5/2/2022 06:31 - 5/2/2022 12:00	| 500  |
		| 2  | 5/2/2022 12:00 - 5/2/2022 18:20	| 1000 |